ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32L4xx/stm32l4q5xx.h
/********************  Bits definition for PSSI_SR register  ******************/
#define PSSI_SR_RTT4B_Pos             (2U)
#define PSSI_SR_RTT4B_Msk             (0x1UL << PSSI_SR_RTT4B_Pos)             /*!< 0x00000004 */
#define PSSI_SR_RTT4B                 PSSI_SR_RTT4B_Msk                        /*!< FIFO is Ready To Transfer 4 Bytes */
#define PSSI_SR_RTT1B_Pos             (3U)
#define PSSI_SR_RTT1B_Msk             (0x1UL << PSSI_SR_RTT1B_Pos)             /*!< 0x00000008 */
#define PSSI_SR_RTT1B                 PSSI_SR_RTT1B_Msk                        /*!< FIFO is Ready To Transfer 1 Byte */

/********************  Bits definition for PSSI_RIS register  *****************/
#define PSSI_RIS_OVR_RIS_Pos          (1U)
#define PSSI_RIS_OVR_RIS_Msk          (0x1UL << PSSI_RIS_OVR_RIS_Pos)          /*!< 0x00000002 */
#define PSSI_RIS_OVR_RIS              PSSI_RIS_OVR_RIS_Msk                     /*!< Data buffer overrun/underrun raw interrupt status */

/********************  Bits definition for PSSI_IER register  *****************/
#define PSSI_IER_OVR_IE_Pos           (1U)
#define PSSI_IER_OVR_IE_Msk           (0x1UL << PSSI_IER_OVR_IE_Pos)           /*!< 0x00000002 */
#define PSSI_IER_OVR_IE               PSSI_IER_OVR_IE_Msk                      /*!< Data buffer overrun/underrun interrupt enable */

/********************  Bits definition for PSSI_MIS register  *****************/
#define PSSI_MIS_OVR_MIS_Pos          (1U)
#define PSSI_MIS_OVR_MIS_Msk          (0x1UL << PSSI_MIS_OVR_MIS_Pos)          /*!< 0x00000002 */
#define PSSI_MIS_OVR_MIS              PSSI_MIS_OVR_MIS_Msk                     /*!< Data buffer overrun/underrun masked interrupt status */

/********************  Bits definition for PSSI_ICR register  *****************/
#define PSSI_ICR_OVR_ISC_Pos          (1U)
#define PSSI_ICR_OVR_ISC_Msk          (0x1UL << PSSI_ICR_OVR_ISC_Pos)          /*!< 0x00000002 */
#define PSSI_ICR_OVR_ISC              PSSI_ICR_OVR_ISC_Msk                     /*!< Data buffer overrun/underrun interrupt status clear */

/********************  Bits definition for PSSI_DR register  **************/
#define PSSI_DR_BYTE0_Pos             (0U)
#define PSSI_DR_BYTE0_Msk             (0xFFUL << PSSI_DR_BYTE0_Pos)            /*!< 0x000000FF */
#define PSSI_DR_BYTE0                 PSSI_DR_BYTE0_Msk                        /*!< PSSI Data byte 0 Byte0[7:0] */
#define PSSI_DR_BYTE0_0               (0x01UL << PSSI_DR_BYTE0_Pos)            /*!< 0x00000001 */
#define PSSI_DR_BYTE0_1               (0x02UL << PSSI_DR_BYTE0_Pos)            /*!< 0x00000002 */
#define PSSI_DR_BYTE0_2               (0x04UL << PSSI_DR_BYTE0_Pos)            /*!< 0x00000004 */
#define PSSI_DR_BYTE0_3               (0x08UL << PSSI_DR_BYTE0_Pos)            /*!< 0x00000008 */
#define PSSI_DR_BYTE0_4               (0x10UL << PSSI_DR_BYTE0_Pos)            /*!< 0x00000010 */
#define PSSI_DR_BYTE0_5               (0x20UL << PSSI_DR_BYTE0_Pos)            /*!< 0x00000020 */
#define PSSI_DR_BYTE0_6               (0x40UL << PSSI_DR_BYTE0_Pos)            /*!< 0x00000040 */
#define PSSI_DR_BYTE0_7               (0x80UL << PSSI_DR_BYTE0_Pos)            /*!< 0x00000080 */
#define PSSI_DR_BYTE1_Pos             (8U)
#define PSSI_DR_BYTE1_Msk             (0xFFUL << PSSI_DR_BYTE1_Pos)            /*!< 0x0000FF00 */
#define PSSI_DR_BYTE1                 PSSI_DR_BYTE1_Msk                        /*!< PSSI Data byte 1 Byte1[7:0] */
#define PSSI_DR_BYTE1_0               (0x01UL << PSSI_DR_BYTE1_Pos)            /*!< 0x00000100 */
#define PSSI_DR_BYTE1_1               (0x02UL << PSSI_DR_BYTE1_Pos)            /*!< 0x00000200 */
#define PSSI_DR_BYTE1_2               (0x04UL << PSSI_DR_BYTE1_Pos)            /*!< 0x00000400 */
#define PSSI_DR_BYTE1_3               (0x08UL << PSSI_DR_BYTE1_Pos)            /*!< 0x00000800 */
#define PSSI_DR_BYTE1_4               (0x10UL << PSSI_DR_BYTE1_Pos)            /*!< 0x00001000 */
#define PSSI_DR_BYTE1_5               (0x20UL << PSSI_DR_BYTE1_Pos)            /*!< 0x00002000 */
#define PSSI_DR_BYTE1_6               (0x40UL << PSSI_DR_BYTE1_Pos)            /*!< 0x00004000 */
#define PSSI_DR_BYTE1_7               (0x80UL << PSSI_DR_BYTE1_Pos)            /*!< 0x00008000 */
#define PSSI_DR_BYTE2_Pos             (16U)
#define PSSI_DR_BYTE2_Msk             (0xFFUL << PSSI_DR_BYTE2_Pos)            /*!< 0x00FF0000 */
#define PSSI_DR_BYTE2                 PSSI_DR_BYTE2_Msk                        /*!< PSSI Data byte 2 Byte2[7:0] */
#define PSSI_DR_BYTE2_0               (0x01UL << PSSI_DR_BYTE2_Pos)            /*!< 0x00010000 */
#define PSSI_DR_BYTE2_1               (0x02UL << PSSI_DR_BYTE2_Pos)            /*!< 0x00020000 */
#define PSSI_DR_BYTE2_2               (0x04UL << PSSI_DR_BYTE2_Pos)            /*!< 0x00040000 */
#define PSSI_DR_BYTE2_3               (0x08UL << PSSI_DR_BYTE2_Pos)            /*!< 0x00080000 */
#define PSSI_DR_BYTE2_4               (0x10UL << PSSI_DR_BYTE2_Pos)            /*!< 0x00100000 */
#define PSSI_DR_BYTE2_5               (0x20UL << PSSI_DR_BYTE2_Pos)            /*!< 0x00200000 */
#define PSSI_DR_BYTE2_6               (0x40UL << PSSI_DR_BYTE2_Pos)            /*!< 0x00400000 */
#define PSSI_DR_BYTE2_7               (0x80UL << PSSI_DR_BYTE2_Pos)            /*!< 0x00800000 */
#define PSSI_DR_BYTE3_Pos             (24U)
#define PSSI_DR_BYTE3_Msk             (0xFFUL << PSSI_DR_BYTE3_Pos)            /*!< 0xFF000000 */
#define PSSI_DR_BYTE3                 PSSI_DR_BYTE3_Msk                        /*!< PSSI Data byte 3 Byte3[7:0] */
#define PSSI_DR_BYTE3_0               (0x01UL << PSSI_DR_BYTE3_Pos)            /*!< 0x01000000 */
#define PSSI_DR_BYTE3_1               (0x02UL << PSSI_DR_BYTE3_Pos)            /*!< 0x02000000 */
#define PSSI_DR_BYTE3_2               (0x04UL << PSSI_DR_BYTE3_Pos)            /*!< 0x04000000 */
#define PSSI_DR_BYTE3_3               (0x08UL << PSSI_DR_BYTE3_Pos)            /*!< 0x08000000 */
#define PSSI_DR_BYTE3_4               (0x10UL << PSSI_DR_BYTE3_Pos)            /*!< 0x10000000 */
#define PSSI_DR_BYTE3_5               (0x20UL << PSSI_DR_BYTE3_Pos)            /*!< 0x20000000 */
#define PSSI_DR_BYTE3_6               (0x40UL << PSSI_DR_BYTE3_Pos)            /*!< 0x40000000 */
#define PSSI_DR_BYTE3_7               (0x80UL << PSSI_DR_BYTE3_Pos)            /*!< 0x80000000 */

/******************************************************************************/
/*                                                                            */
/*                       Public Key Accelerator (PKA)                         */
/*                                                                            */
/******************************************************************************/

